exampleCases/other/turbineTuning_DTU10MW_ALMAdv/2refinement_runs/10MW_2refinements_dt0.20_template/system/setFieldsABLDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          setFieldsABLDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


// Extents of the domain.
xMin                      $xMin;
yMin                      $yMin;
zMin                      $zMin;

xMax                      $xMax;
yMax                      $yMax;
zMax                      $zMax;

zRef                      $zMax;

// Specify if distance from wall should be used as z.
useWallDistZ              false;
scaleVelocityWithHeight   false;


// Specify how to initialze the base velocity and temperature profile.
velocityInitType          "table";
//velocityInitType          "log";
//velocityInitType          "geostrophic";
temperatureInitType       "table";
//temperatureInitType       "simple";

// Maximum perturbation of streamwise/spanwise flow near surface.
deltaU                    0.25;
deltaV                    0.25;

// Total periods of perturbations in streamwise/spanwise in the domain.
Uperiods                  12.0;
Vperiods                  12.0;

// Percentage of domain height (zMax) where peak in perturbation 
// magnitude occurs.
zPeak                     0.015;

// Initial height of the center of the capping inversion.
zInversion                $zInversion;

// Width of the capping inversion.
widthInversion            $inversionWidth;

// Potential temperature at the bottom and top of the capping inversion.
Tbottom                   $TBottom;
Ttop                      $TTop;

// Maximum temperature fluctuation size below capping inversion.
TPrimeScale               0.0;

// Height rate of change of potential temperature above the inversion.
dTdz                      $TGradUpper;

// Geostrophic wind speed magnitude.
Ug                        $U0Mag;

// Geostrophic wind speed direction.
UgDir                     $dir;

// Aerodynamic roughness height of surface.
z0                        $z0;

// von Karman constant.
kappa                     $kappa;

// Vertical profile table.
profileTable
(
//   z          U       V        T
    (0.0 0.0 0.0 273.121917725)
    (5.0 1.82671529027 1.98969371553 282.524156211)
    (10.0 2.52983624172 2.77228242751 283.156504284)
    (15.0 3.01282071998 3.35521702288 283.64108812)
    (20.0 3.35996148006 3.78823607698 284.090761147)
    (25.0 3.8038057643 4.37960852586 284.554077196)
    (30.0 4.03596125279 4.70538923119 284.966777157)
    (35.0 4.38133296535 5.23253766126 285.360167677)
    (40.0 4.56992779673 5.53523659867 285.747101612)
    (45.0 4.80994398595 5.96180841679 286.095879197)
    (50.0 5.00816921409 6.32774876853 286.444585293)
    (55.0 5.14154903327 6.60160807137 286.787914506)
    (60.0 5.36818530188 7.08896005703 287.063199891)
    (65.0 5.44703987742 7.27484159809 287.379906732)
    (70.0 5.57604433164 7.60608624795 287.638417176)
    (75.0 5.72370142776 7.99632935101 287.863981004)
    (80.0 5.77619905069 8.15139018101 288.127106742)
    (85.0 5.87149793296 8.46369430537 288.331005696)
    (90.0 5.98111916718 8.83268873958 288.509035882)
    (95.0 6.01697152506 8.97407895539 288.724664101)
    (100.0 6.06967854005 9.19927028309 288.909565287)
    (105.0 6.1450628792 9.53721293929 289.053124377)
    (110.0 6.19167607924 9.76288104253 289.198531813)
    (115.0 6.22489630605 9.93628531022 289.344799656)
    (120.0 6.27421288656 10.216282683 289.462005)
    (125.0 6.32645248876 10.5156368594 289.57393273)
    (130.0 6.34668810144 10.6457361726 289.712125634)
    (135.0 6.36434613795 10.762203832 289.852433913)
    (140.0 6.39842793739 11.0196195883 289.95191863)
    (145.0 6.4342454375 11.2919310606 290.047089019)
    (150.0 6.45180421766 11.4367005351 290.150649381)
    (155.0 6.46406875681 11.544488333 290.256642472)
    (160.0 6.48170756073 11.7056278368 290.348224267)
    (165.0 6.50382814701 11.9112591447 290.427787992)
    (170.0 6.52550956366 12.1127414485 290.506470121)
    (175.0 6.54550549533 12.298300329 290.581768788)
    (180.0 6.56550142701 12.4838592096 290.657067454)
    (185.0 6.58511534034 12.6567515091 290.735008491)
    (190.0 6.6045979288 12.8252894701 290.813857884)
    (195.0 6.62432001649 12.9896812983 290.892328604)
    (200.0 6.64532587961 13.1318488244 290.968769537)
    (205.0 6.66633174272 13.2740163505 291.045210471)
    (210.0 6.69104111181 13.4098514016 291.117435921)
    (215.0 6.72036475996 13.5377966838 291.184409209)
    (220.0 6.74968840812 13.6657419659 291.251382497)
    (225.0 6.77805691412 13.7640369251 291.318657013)
    (230.0 6.80578882059 13.8425700289 291.386132296)
    (235.0 6.83352072706 13.9211031327 291.453607578)
    (240.0 6.86307156947 13.9862481909 291.518273832)
    (245.0 6.89380511232 14.0426881336 291.581113612)
    (250.0 6.92453865516 14.0991280764 291.643953391)
    (255.0 6.95361693104 14.1462680315 291.704700258)
    (260.0 6.98077095142 14.1825967081 291.763014104)
    (265.0 7.0079249718 14.2189253847 291.82132795)
    (270.0 7.03507703408 14.2541299666 291.879606535)
    (275.0 7.0622194383 14.283790106 291.937711201)
    (280.0 7.08936184253 14.3134502454 291.995815867)
    (285.0 7.11650424675 14.3431103848 292.053920533)
    (290.0 7.1430391081 14.369131837 292.11328027)
    (295.0 7.16932392788 14.3936557439 292.173156546)
    (300.0 7.19560874767 14.4181796507 292.233032822)
    (305.0 7.22180906756 14.4424461024 292.292838021)
    (310.0 7.24680913749 14.4630556198 292.351633627)
    (315.0 7.27180920741 14.4836651372 292.410429232)
    (320.0 7.29680927734 14.5042746546 292.469224837)
    (325.0 7.32153609499 14.5243042572 292.528664796)
    (330.0 7.34543057757 14.5425674214 292.590067475)
    (335.0 7.36932506015 14.5608305855 292.651470155)
    (340.0 7.39321954273 14.5790937496 292.712872834)
    (345.0 7.41696733387 14.597025575 292.773542958)
    (350.0 7.44026003553 14.6139294685 292.831940429)
    (355.0 7.46355273718 14.6308333621 292.890337899)
    (360.0 7.48684543884 14.6477372556 292.94873537)
    (365.0 7.51013186129 14.6646271523 293.007149353)
    (370.0 7.53322339247 14.68108262 293.066075821)
    (375.0 7.55631492366 14.6975380877 293.12500229)
    (380.0 7.57940645484 14.7139935554 293.183928758)
    (385.0 7.60249798603 14.7304490231 293.242855226)
    (390.0 7.6257582057 14.7463924565 293.301506178)
    (395.0 7.64912373233 14.7620162427 293.359985132)
    (400.0 7.67248925896 14.7776400289 293.418464087)
    (405.0 7.69585478559 14.7932638151 293.476943042)
    (410.0 7.71922031222 14.8088876013 293.535421996)
    (415.0 7.74300228036 14.8230663689 293.592791002)
    (420.0 7.7667927399 14.8372156721 293.650137374)
    (425.0 7.79058319945 14.8513649753 293.707483747)
    (430.0 7.81437365899 14.8655142784 293.76483012)
    (435.0 7.83815083397 14.8793492717 293.821767406)
    (440.0 7.86181714661 14.8905612872 293.875290779)
    (445.0 7.88548345926 14.9017733027 293.928814153)
    (450.0 7.9091497719 14.9129853182 293.982337526)
    (455.0 7.93281608455 14.9241973336 294.035860899)
    (460.0 7.95648239719 14.9354093491 294.089384273)
    (465.0 7.97905964048 14.9423301431 294.14128451)
    (470.0 8.0016312311 14.9492286641 294.193176323)
    (475.0 8.02420282171 14.956127185 294.245068135)
    (480.0 8.04677441233 14.9630257059 294.296959948)
    (485.0 8.06934600294 14.9699242269 294.34885176)
    (490.0 8.0912068028 14.9742300558 294.40025773)
    (495.0 8.11235909886 14.9759515346 294.45117942)
...
);

// Update internal field.
updateInternalFields      true;

// Update boundary field.
updateBoundaryFields      false;

// ************************************************************************* //
